## Plan Result (stg-cftapps_cluster_lb_backend)




<pre><code>Plan: 0 to add, 3 to change, 0 to destroy.</code></pre>

* Update
  * module.app-gw.azurerm_application_gateway.ag[1]
  * module.app-gw.azurerm_monitor_diagnostic_setting.diagnostic_settings[0]
  * module.app-gw.azurerm_monitor_diagnostic_setting.diagnostic_settings[1]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.app-gw.data.azurerm_monitor_diagnostic_categories.diagnostic_categories will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_monitor_diagnostic_categories" "diagnostic_categories" {
      + id          = (known after apply)
      + logs        = (known after apply)
      + metrics     = (known after apply)
      + resource_id = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks00-aat-agw"

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.app-gw.azurerm_application_gateway.ag[1] will be updated in-place
  ~ resource "azurerm_application_gateway" "ag" {
        id                  = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw"
        name                = "aks01-aat-agw"
        tags                = {
            "application"  = "core"
            "builtFrom"    = "hmcts/azure-platform-terraform"
            "businessArea" = "CFT"
            "criticality"  = "High"
            "environment"  = "staging"
        }
        # (4 unchanged attributes hidden)


      + backend_address_pool {
          + ip_addresses = [
              + "10.10.143.250",
              + "10.10.159.250",
            ]
          + name         = "sscs-hearings-api"
        }

      + backend_http_settings {
          + cookie_based_affinity               = "Disabled"
          + name                                = "sscs-hearings-api"
          + pick_host_name_from_backend_address = false
          + port                                = 80
          + probe_name                          = "sscs-hearings-api"
          + protocol                            = "Http"
          + request_timeout                     = 30
        }




      + http_listener {
          + frontend_ip_configuration_name = "appGwPrivateFrontendIp"
          + frontend_port_name             = "http"
          + host_name                      = "sscs-hearings-api-aat.service.core-compute-aat.internal"
          + name                           = "sscs-hearings-api"
          + protocol                       = "Http"
        }


      + probe {
          + host                                      = "sscs-hearings-api-aat.service.core-compute-aat.internal"
          + interval                                  = 10
          + minimum_servers                           = 0
          + name                                      = "sscs-hearings-api"
          + path                                      = "/health/liveness"
          + pick_host_name_from_backend_http_settings = false
          + protocol                                  = "Http"
          + timeout                                   = 15
          + unhealthy_threshold                       = 3

          + match {
              + body        = (known after apply)
              + status_code = (known after apply)
            }
        }

      - request_routing_rule {
          - backend_address_pool_id    = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/backendAddressPools/camunda-optimize" -> null
          - backend_address_pool_name  = "camunda-optimize" -> null
          - backend_http_settings_id   = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/backendHttpSettingsCollection/camunda-optimize" -> null
          - backend_http_settings_name = "camunda-optimize" -> null
          - http_listener_id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/httpListeners/camunda-optimize" -> null
          - http_listener_name         = "camunda-optimize" -> null
          - id                         = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/requestRoutingRules/camunda-optimize" -> null
          - name                       = "camunda-optimize" -> null
          - rule_type                  = "Basic" -> null
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/backendAddressPools/camunda-optimize"
          + backend_address_pool_name  = "camunda-optimize"
          + backend_http_settings_id   = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/backendHttpSettingsCollection/camunda-optimize"
          + backend_http_settings_name = "camunda-optimize"
          + http_listener_id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/httpListeners/camunda-optimize"
          + http_listener_name         = "camunda-optimize"
          + id                         = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/requestRoutingRules/camunda-optimize"
          + name                       = "camunda-optimize"
          + rule_type                  = "Basic"
        }
      - request_routing_rule {
          - backend_address_pool_id    = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/backendAddressPools/cpo-case-payment-orders-api" -> null
          - backend_address_pool_name  = "cpo-case-payment-orders-api" -> null
          - backend_http_settings_id   = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/backendHttpSettingsCollection/cpo-case-payment-orders-api" -> null
          - backend_http_settings_name = "cpo-case-payment-orders-api" -> null
          - http_listener_id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/httpListeners/cpo-case-payment-orders-api" -> null
          - http_listener_name         = "cpo-case-payment-orders-api" -> null
          - id                         = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/requestRoutingRules/cpo-case-payment-orders-api" -> null
          - name                       = "cpo-case-payment-orders-api" -> null
          - rule_type                  = "Basic" -> null
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/backendAddressPools/cpo-case-payment-orders-api"
          + backend_address_pool_name  = "cpo-case-payment-orders-api"
          + backend_http_settings_id   = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/backendHttpSettingsCollection/cpo-case-payment-orders-api"
          + backend_http_settings_name = "cpo-case-payment-orders-api"
          + http_listener_id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/httpListeners/cpo-case-payment-orders-api"
          + http_listener_name         = "cpo-case-payment-orders-api"
          + id                         = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/requestRoutingRules/cpo-case-payment-orders-api"
          + name                       = "cpo-case-payment-orders-api"
          + rule_type                  = "Basic"
        }
      - request_routing_rule {
          - backend_address_pool_id    = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/backendAddressPools/em-ped-api" -> null
          - backend_address_pool_name  = "em-ped-api" -> null
          - backend_http_settings_id   = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/backendHttpSettingsCollection/em-ped-api" -> null
          - backend_http_settings_name = "em-ped-api" -> null
          - http_listener_id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/httpListeners/em-ped-api" -> null
          - http_listener_name         = "em-ped-api" -> null
          - id                         = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/requestRoutingRules/em-ped-api" -> null
          - name                       = "em-ped-api" -> null
          - rule_type                  = "Basic" -> null
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/backendAddressPools/em-ped-api"
          + backend_address_pool_name  = "em-ped-api"
          + backend_http_settings_id   = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/backendHttpSettingsCollection/em-ped-api"
          + backend_http_settings_name = "em-ped-api"
          + http_listener_id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/httpListeners/em-ped-api"
          + http_listener_name         = "em-ped-api"
          + id                         = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/requestRoutingRules/em-ped-api"
          + name                       = "em-ped-api"
          + rule_type                  = "Basic"
        }
      - request_routing_rule {
          - backend_address_pool_id    = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/backendAddressPools/et-cos" -> null
          - backend_address_pool_name  = "et-cos" -> null
          - backend_http_settings_id   = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/backendHttpSettingsCollection/et-cos" -> null
          - backend_http_settings_name = "et-cos" -> null
          - http_listener_id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/httpListeners/et-cos" -> null
          - http_listener_name         = "et-cos" -> null
          - id                         = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/requestRoutingRules/et-cos" -> null
          - name                       = "et-cos" -> null
          - rule_type                  = "Basic" -> null
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/backendAddressPools/et-cos"
          + backend_address_pool_name  = "et-cos"
          + backend_http_settings_id   = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/backendHttpSettingsCollection/et-cos"
          + backend_http_settings_name = "et-cos"
          + http_listener_id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/httpListeners/et-cos"
          + http_listener_name         = "et-cos"
          + id                         = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/requestRoutingRules/et-cos"
          + name                       = "et-cos"
          + rule_type                  = "Basic"
        }
      - request_routing_rule {
          - backend_address_pool_id    = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/backendAddressPools/et-msg-handler" -> null
          - backend_address_pool_name  = "et-msg-handler" -> null
          - backend_http_settings_id   = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/backendHttpSettingsCollection/et-msg-handler" -> null
          - backend_http_settings_name = "et-msg-handler" -> null
          - http_listener_id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/httpListeners/et-msg-handler" -> null
          - http_listener_name         = "et-msg-handler" -> null
          - id                         = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/requestRoutingRules/et-msg-handler" -> null
          - name                       = "et-msg-handler" -> null
          - rule_type                  = "Basic" -> null
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/backendAddressPools/et-msg-handler"
          + backend_address_pool_name  = "et-msg-handler"
          + backend_http_settings_id   = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/backendHttpSettingsCollection/et-msg-handler"
          + backend_http_settings_name = "et-msg-handler"
          + http_listener_id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/httpListeners/et-msg-handler"
          + http_listener_name         = "et-msg-handler"
          + id                         = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/requestRoutingRules/et-msg-handler"
          + name                       = "et-msg-handler"
          + rule_type                  = "Basic"
        }
      - request_routing_rule {
          - backend_address_pool_id    = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/backendAddressPools/et-sya-api" -> null
          - backend_address_pool_name  = "et-sya-api" -> null
          - backend_http_settings_id   = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/backendHttpSettingsCollection/et-sya-api" -> null
          - backend_http_settings_name = "et-sya-api" -> null
          - http_listener_id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/httpListeners/et-sya-api" -> null
          - http_listener_name         = "et-sya-api" -> null
          - id                         = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/requestRoutingRules/et-sya-api" -> null
          - name                       = "et-sya-api" -> null
          - rule_type                  = "Basic" -> null
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/backendAddressPools/et-sya-api"
          + backend_address_pool_name  = "et-sya-api"
          + backend_http_settings_id   = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/backendHttpSettingsCollection/et-sya-api"
          + backend_http_settings_name = "et-sya-api"
          + http_listener_id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/httpListeners/et-sya-api"
          + http_listener_name         = "et-sya-api"
          + id                         = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/requestRoutingRules/et-sya-api"
          + name                       = "et-sya-api"
          + rule_type                  = "Basic"
        }
      - request_routing_rule {
          - backend_address_pool_id    = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/backendAddressPools/fis-bulk-scan-api" -> null
          - backend_address_pool_name  = "fis-bulk-scan-api" -> null
          - backend_http_settings_id   = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/backendHttpSettingsCollection/fis-bulk-scan-api" -> null
          - backend_http_settings_name = "fis-bulk-scan-api" -> null
          - http_listener_id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/httpListeners/fis-bulk-scan-api" -> null
          - http_listener_name         = "fis-bulk-scan-api" -> null
          - id                         = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/requestRoutingRules/fis-bulk-scan-api" -> null
          - name                       = "fis-bulk-scan-api" -> null
          - rule_type                  = "Basic" -> null
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/backendAddressPools/fis-bulk-scan-api"
          + backend_address_pool_name  = "fis-bulk-scan-api"
          + backend_http_settings_id   = "/subscriptions/96c274ce-846d-4e48-89a7-d

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

m-recipe-backend"
          + http_listener_id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/httpListeners/plum-recipe-backend"
          + http_listener_name         = "plum-recipe-backend"
          + id                         = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/requestRoutingRules/plum-recipe-backend"
          + name                       = "plum-recipe-backend"
          + rule_type                  = "Basic"
        }
      - request_routing_rule {
          - backend_address_pool_id    = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/backendAddressPools/prl-cos" -> null
          - backend_address_pool_name  = "prl-cos" -> null
          - backend_http_settings_id   = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/backendHttpSettingsCollection/prl-cos" -> null
          - backend_http_settings_name = "prl-cos" -> null
          - http_listener_id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/httpListeners/prl-cos" -> null
          - http_listener_name         = "prl-cos" -> null
          - id                         = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/requestRoutingRules/prl-cos" -> null
          - name                       = "prl-cos" -> null
          - rule_type                  = "Basic" -> null
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/backendAddressPools/prl-cos"
          + backend_address_pool_name  = "prl-cos"
          + backend_http_settings_id   = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/backendHttpSettingsCollection/prl-cos"
          + backend_http_settings_name = "prl-cos"
          + http_listener_id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/httpListeners/prl-cos"
          + http_listener_name         = "prl-cos"
          + id                         = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/requestRoutingRules/prl-cos"
          + name                       = "prl-cos"
          + rule_type                  = "Basic"
        }
      - request_routing_rule {
          - backend_address_pool_id    = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/backendAddressPools/prl-dgs" -> null
          - backend_address_pool_name  = "prl-dgs" -> null
          - backend_http_settings_id   = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/backendHttpSettingsCollection/prl-dgs" -> null
          - backend_http_settings_name = "prl-dgs" -> null
          - http_listener_id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/httpListeners/prl-dgs" -> null
          - http_listener_name         = "prl-dgs" -> null
          - id                         = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/requestRoutingRules/prl-dgs" -> null
          - name                       = "prl-dgs" -> null
          - rule_type                  = "Basic" -> null
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/backendAddressPools/prl-dgs"
          + backend_address_pool_name  = "prl-dgs"
          + backend_http_settings_id   = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/backendHttpSettingsCollection/prl-dgs"
          + backend_http_settings_name = "prl-dgs"
          + http_listener_id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/httpListeners/prl-dgs"
          + http_listener_name         = "prl-dgs"
          + id                         = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/requestRoutingRules/prl-dgs"
          + name                       = "prl-dgs"
          + rule_type                  = "Basic"
        }
      - request_routing_rule {
          - backend_address_pool_id    = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/backendAddressPools/rpts-api" -> null
          - backend_address_pool_name  = "rpts-api" -> null
          - backend_http_settings_id   = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/backendHttpSettingsCollection/rpts-api" -> null
          - backend_http_settings_name = "rpts-api" -> null
          - http_listener_id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/httpListeners/rpts-api" -> null
          - http_listener_name         = "rpts-api" -> null
          - id                         = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/requestRoutingRules/rpts-api" -> null
          - name                       = "rpts-api" -> null
          - rule_type                  = "Basic" -> null
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/backendAddressPools/rpts-api"
          + backend_address_pool_name  = "rpts-api"
          + backend_http_settings_id   = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/backendHttpSettingsCollection/rpts-api"
          + backend_http_settings_name = "rpts-api"
          + http_listener_id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/httpListeners/rpts-api"
          + http_listener_name         = "rpts-api"
          + id                         = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/requestRoutingRules/rpts-api"
          + name                       = "rpts-api"
          + rule_type                  = "Basic"
        }
      - request_routing_rule {
          - backend_address_pool_id    = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/backendAddressPools/ts-translation-service" -> null
          - backend_address_pool_name  = "ts-translation-service" -> null
          - backend_http_settings_id   = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/backendHttpSettingsCollection/ts-translation-service" -> null
          - backend_http_settings_name = "ts-translation-service" -> null
          - http_listener_id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/httpListeners/ts-translation-service" -> null
          - http_listener_name         = "ts-translation-service" -> null
          - id                         = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/requestRoutingRules/ts-translation-service" -> null
          - name                       = "ts-translation-service" -> null
          - rule_type                  = "Basic" -> null
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/backendAddressPools/ts-translation-service"
          + backend_address_pool_name  = "ts-translation-service"
          + backend_http_settings_id   = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/backendHttpSettingsCollection/ts-translation-service"
          + backend_http_settings_name = "ts-translation-service"
          + http_listener_id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/httpListeners/ts-translation-service"
          + http_listener_name         = "ts-translation-service"
          + id                         = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/requestRoutingRules/ts-translation-service"
          + name                       = "ts-translation-service"
          + rule_type                  = "Basic"
        }
      - request_routing_rule {
          - backend_address_pool_id    = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/backendAddressPools/wa-case-event-handler" -> null
          - backend_address_pool_name  = "wa-case-event-handler" -> null
          - backend_http_settings_id   = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/backendHttpSettingsCollection/wa-case-event-handler" -> null
          - backend_http_settings_name = "wa-case-event-handler" -> null
          - http_listener_id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/httpListeners/wa-case-event-handler" -> null
          - http_listener_name         = "wa-case-event-handler" -> null
          - id                         = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/requestRoutingRules/wa-case-event-handler" -> null
          - name                       = "wa-case-event-handler" -> null
          - rule_type                  = "Basic" -> null
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/backendAddressPools/wa-case-event-handler"
          + backend_address_pool_name  = "wa-case-event-handler"
          + backend_http_settings_id   = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/backendHttpSettingsCollection/wa-case-event-handler"
          + backend_http_settings_name = "wa-case-event-handler"
          + http_listener_id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/httpListeners/wa-case-event-handler"
          + http_listener_name         = "wa-case-event-handler"
          + id                         = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/requestRoutingRules/wa-case-event-handler"
          + name                       = "wa-case-event-handler"
          + rule_type                  = "Basic"
        }
      - request_routing_rule {
          - backend_address_pool_id    = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/backendAddressPools/wa-task-monitor" -> null
          - backend_address_pool_name  = "wa-task-monitor" -> null
          - backend_http_settings_id   = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/backendHttpSettingsCollection/wa-task-monitor" -> null
          - backend_http_settings_name = "wa-task-monitor" -> null
          - http_listener_id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/httpListeners/wa-task-monitor" -> null
          - http_listener_name         = "wa-task-monitor" -> null
          - id                         = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/requestRoutingRules/wa-task-monitor" -> null
          - name                       = "wa-task-monitor" -> null
          - rule_type                  = "Basic" -> null
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/backendAddressPools/wa-task-monitor"
          + backend_address_pool_name  = "wa-task-monitor"
          + backend_http_settings_id   = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/backendHttpSettingsCollection/wa-task-monitor"
          + backend_http_settings_name = "wa-task-monitor"
          + http_listener_id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/httpListeners/wa-task-monitor"
          + http_listener_name         = "wa-task-monitor"
          + id                         = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/requestRoutingRules/wa-task-monitor"
          + name                       = "wa-task-monitor"
          + rule_type                  = "Basic"
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "sscs-hearings-api"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "sscs-hearings-api"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "sscs-hearings-api"
          + id                         = (known after apply)
          + name                       = "sscs-hearings-api"
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }



        # (106 unchanged blocks hidden)
    }

  # module.app-gw.azurerm_monitor_diagnostic_setting.diagnostic_settings[0] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "diagnostic_settings" {
        id                         = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks00-aat-agw|AppGw"
        name                       = "AppGw"
        # (2 unchanged attributes hidden)

      - log {
          - category = "ApplicationGatewayAccessLog" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      - log {
          - category = "ApplicationGatewayFirewallLog" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      - log {
          - category = "ApplicationGatewayPerformanceLog" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = true -> null
            }
        }
      + metric {
          + category = (known after apply)
          + enabled  = (known after apply)

          + retention_policy {
              + days    = (known after apply)
              + enabled = (known after apply)
            }
        }
    }

  # module.app-gw.azurerm_monitor_diagnostic_setting.diagnostic_settings[1] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "diagnostic_settings" {
        id                         = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw|AppGw"
        name                       = "AppGw"
        # (2 unchanged attributes hidden)

      - log {
          - category = "ApplicationGatewayAccessLog" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      - log {
          - category = "ApplicationGatewayFirewallLog" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      - log {
          - category = "ApplicationGatewayPerformanceLog" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = true -> null
            }
        }
      + metric {
          + category = (known after apply)
          + enabled  = (known after apply)

          + retention_policy {
              + days    = (known after apply)
              + enabled = (known after apply)
            }
        }
    }

Plan: 0 to add, 3 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":1286,"Program":"tfcmt","SHA1":"","Target":"stg-cftapps_cluster_lb_backend","Vars":{}} -->